reactive-company/wrk2/t1c1d15-gb.txt
Running 15s test @ http://localhost:8080/stream
  1 threads and 1 connections
  Thread calibration: mean lat.: 4616.498ms, rate sampling interval: 16596ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.53s     1.33s   13.82s    57.66%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.53s 
 75.000%   12.68s 
 90.000%   13.37s 
 99.000%   13.79s 
 99.900%   13.83s 
 99.990%   13.83s 
 99.999%   13.83s 
100.000%   13.83s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9232.383     0.000000            2         1.00
    9682.943     0.100000           78         1.11
   10149.887     0.200000          157         1.25
   10608.639     0.300000          234         1.43
   11067.391     0.400000          311         1.67
   11534.335     0.500000          390         2.00
   11763.711     0.550000          429         2.22
   11993.087     0.600000          468         2.50
   12222.463     0.650000          506         2.86
   12451.839     0.700000          545         3.33
   12681.215     0.750000          583         4.00
   12804.095     0.775000          604         4.44
   12910.591     0.800000          622         5.00
   13033.471     0.825000          642         5.71
   13148.159     0.850000          662         6.67
   13254.655     0.875000          680         8.00
   13320.191     0.887500          691         8.89
   13377.535     0.900000          700        10.00
   13434.879     0.912500          710        11.43
   13492.223     0.925000          720        13.33
   13549.567     0.937500          729        16.00
   13574.143     0.943750          734        17.78
   13606.911     0.950000          739        20.00
   13631.487     0.956250          744        22.86
   13656.063     0.962500          748        26.67
   13688.831     0.968750          753        32.00
   13705.215     0.971875          756        35.56
   13721.599     0.975000          759        40.00
   13737.983     0.978125          761        45.71
   13746.175     0.981250          763        53.33
   13762.559     0.984375          765        64.00
   13770.751     0.985938          767        71.11
   13778.943     0.987500          768        80.00
   13787.135     0.989062          770        91.43
   13787.135     0.990625          770       106.67
   13795.327     0.992188          771       128.00
   13803.519     0.992969          773       142.22
   13803.519     0.993750          773       160.00
   13803.519     0.994531          773       182.86
   13811.711     0.995313          774       213.33
   13811.711     0.996094          774       256.00
   13819.903     0.996484          775       284.44
   13819.903     0.996875          775       320.00
   13819.903     0.997266          775       365.71
   13828.095     0.997656          777       426.67
   13828.095     1.000000          777          inf
#[Mean    =    11527.109, StdDeviation   =     1330.289]
#[Max     =    13819.904, Total count    =          777]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2337 requests in 15.00s, 49.09MB read
Requests/sec:    155.79
Transfer/sec:      3.27MB
9224192.000000,11527108.694981,13819904.000000,0,0,0