reactive-company/wrk2/t1c1d15.txt
Running 15s test @ http://localhost:8080/stream
  1 threads and 1 connections
  Thread calibration: mean lat.: 975.221ms, rate sampling interval: 3500ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.40s   267.24ms   2.87s    57.33%
    Req/Sec     1.63k     0.00     1.63k   100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.39s 
 75.000%    2.63s 
 90.000%    2.76s 
 99.000%    2.86s 
 99.900%    2.87s 
 99.990%    2.87s 
 99.999%    2.87s 
100.000%    2.87s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1940.479     0.000000            8         1.00
    2029.567     0.100000          818         1.11
    2119.679     0.200000         1639         1.25
    2209.791     0.300000         2450         1.43
    2301.951     0.400000         3258         1.67
    2394.111     0.500000         4068         2.00
    2441.215     0.550000         4477         2.22
    2502.655     0.600000         4893         2.50
    2545.663     0.650000         5297         2.86
    2588.671     0.700000         5707         3.33
    2631.679     0.750000         6108         4.00
    2654.207     0.775000         6313         4.44
    2676.735     0.800000         6516         5.00
    2699.263     0.825000         6722         5.71
    2719.743     0.850000         6911         6.67
    2742.271     0.875000         7114         8.00
    2754.559     0.887500         7233         8.89
    2764.799     0.900000         7327        10.00
    2775.039     0.912500         7424        11.43
    2785.279     0.925000         7520        13.33
    2799.615     0.937500         7634        16.00
    2803.711     0.943750         7677        17.78
    2809.855     0.950000         7733        20.00
    2815.999     0.956250         7786        22.86
    2822.143     0.962500         7837        26.67
    2828.287     0.968750         7881        32.00
    2830.335     0.971875         7901        35.56
    2834.431     0.975000         7930        40.00
    2842.623     0.978125         7962        45.71
    2846.719     0.981250         7990        53.33
    2850.815     0.984375         8011        64.00
    2852.863     0.985938         8027        71.11
    2854.911     0.987500         8041        80.00
    2854.911     0.989062         8041        91.43
    2859.007     0.990625         8067       106.67
    2859.007     0.992188         8067       128.00
    2861.055     0.992969         8075       142.22
    2863.103     0.993750         8092       160.00
    2863.103     0.994531         8092       182.86
    2863.103     0.995313         8092       213.33
    2865.151     0.996094         8100       256.00
    2867.199     0.996484         8116       284.44
    2867.199     0.996875         8116       320.00
    2867.199     0.997266         8116       365.71
    2867.199     0.997656         8116       426.67
    2867.199     0.998047         8116       512.00
    2867.199     0.998242         8116       568.89
    2869.247     0.998437         8124       640.00
    2869.247     0.998633         8124       731.43
    2869.247     0.998828         8124       853.33
    2869.247     0.999023         8124      1024.00
    2869.247     0.999121         8124      1137.78
    2869.247     0.999219         8124      1280.00
    2869.247     0.999316         8124      1462.86
    2871.295     0.999414         8129      1706.67
    2871.295     1.000000         8129          inf
#[Mean    =     2397.364, StdDeviation   =      267.236]
#[Max     =     2869.248, Total count    =         8129]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24260 requests in 15.00s, 137.89MB read
Requests/sec:   1617.37
Transfer/sec:      9.19MB
1939456.000000,2397363.505474,2869248.000000,0,0,0